<a href="https://colab.research.google.com/github/GYIKOO/UCIMLHackathon21/blob/main/EDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [ ]:
import os
path = os.getcwd()
path

'/content'

In [4]:
df = pd.read_csv('/content/covid_lies.csv')

In [ ]:
df.head()

   misconception_id  ... label
0                 3  ...    na
1                30  ...    na
2                57  ...    na
3                22  ...    na
4                32  ...    na

[5 rows x 5 columns]

## misconception_id

In [ ]:
# Count of tweets related to each misconception
df.groupby('misconception_id')['tweet'].count()\
                  .reset_index(name='count') \
                  .sort_values(['count'], ascending=False).reset_index(drop=True)

    misconception_id  count
0                  3    286
1                 25    192
2                 10    188
3                 15    145
4                  1    100
..               ...    ...
57                52     99
58                13     99
59                32     99
60                39     98
61                38     90

[62 rows x 2 columns]

## tweet_id

In [9]:
tweets_df.groupby('tweet_id')['tweet'].count()\
              .reset_index(name='count') \
              .sort_values(['count'], ascending=False).reset_index(drop=True)

                 tweet_id  count
0     1230000000000000000      3
1     1233962100336267264      1
2     1233961843980488704      1
3     1233961849688928256      1
4     1233961863546888192      1
...                   ...    ...
4339  1233932798790164480      1
4340  1233932801407377408      1
4341  1233932803785408512      1
4342  1233932807803674624      1
4343  1233997840084434944      1

[4344 rows x 2 columns]

In [15]:
# Why did the tweet_id 1230000000000000000 link to 3 different tweets?
tweets_df[tweets_df['tweet_id'] == 1230000000000000000]['tweet'].values

array(['How long does the new coronavirus remain active on surfaces?\nhttps://t.co/ryGWt2c7FB https://t.co/XiPf3wYqJI',
       'Millimetre wave technology will kill an individual by robbing them of oxygen to breath. This begs the question? Is it Corona killing people or is the virus being used to cover-up the implementation of millimetre wave technology? If true, no one is safe.\n\nhttps://t.co/jaegtPGVed',
       'How do we strengthen our immune systems to fight viruses, flus and coronavirus? Should we be taking Vitamin C, minerals, b12 ? What boosts immune system @USERNAME @USERNAME @USERNAME'],
      dtype=object)

## label

In [ ]:
df.groupby('label')['tweet'].count()\
              .reset_index(name='count') \
              .sort_values(['count'], ascending=False).reset_index(drop=True)

  label  count
0    na   6149
1   pos    288
2   neg    154